2020.12.22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-22 Tue 09:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2020.12.15.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2020.12.29.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of December 15 to 22, 2020.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">ocaml-lsp-server 1.4.0</a></li>
<li><a href="#2">OCaml 4.12.0, third alpha release</a></li>
<li><a href="#3">Lwt 5.4.0, Lwt_ppx 2.0.2, Lwt_react 1.1.4 releases</a></li>
<li><a href="#4">Senior software engineer at Docent, France - Remote OK</a></li>
<li><a href="#orge6008b8">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc684b32" class="outline-2">
<h2 id="1">ocaml-lsp-server 1.4.0</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-ocaml-lsp-server-1-4-0/6996/1">https://discuss.ocaml.org/t/ann-ocaml-lsp-server-1-4-0/6996/1</a>
</p>
</div>

<div id="outline-container-org97bf371" class="outline-3">
<h3 id="org97bf371">Rudi Grinberg announced</h3>
<div class="outline-text-3" id="text-org97bf371">
<p>
On behalf of the ocaml-lsp team, it is my pleasure to announce version 1.4.0. This release introduces
support for <a href="https://code.visualstudio.com/api/language-extensions/programmatic-language-features#help-with-function-and-method-signatures">automatic signature
help</a>.
Signature help is not yet present in all possible contexts. We intend to improve to support as many
relevant language constructs as possible in the future. Many thanks to @mnxn for implementing this
feature.
</p>

<p>
The full change log is replicated at the end of this post for your convenience.
</p>

<p>
Happy Holidays!
</p>

<ul class="org-ul">
<li>Support cancellation notifications when possible. (#323)</li>

<li>Implement signature help request for functions (#324)</li>

<li>Server LSP requests &amp; notifications concurrently. Requests that require merlin are still serialized. (#330)</li>
</ul>
</div>
</div>
</div>




<div id="outline-container-orga82968c" class="outline-2">
<h2 id="2">OCaml 4.12.0, third alpha release</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-4-12-0-third-alpha-release/6997/1">https://discuss.ocaml.org/t/ocaml-4-12-0-third-alpha-release/6997/1</a>
</p>
</div>

<div id="outline-container-org00b0cae" class="outline-3">
<h3 id="org00b0cae">octachron announced</h3>
<div class="outline-text-3" id="text-org00b0cae">
<p>
The release of OCaml 4.12.0 is approaching. We have released a third alpha
version to help fellow hackers join us early in our bug hunting and
opam ecosystem fixing fun.
</p>

<p>
Beyond the usual bug fixes, this new alpha version contains two small API fixes
for statmemprof and the Unix module. (Keen-eyed readers might notice a breaking
change in the change log below but this concerns a corner case of a corner case
of the type system that should not affect anyone.)
</p>

<p>
The base compiler can be installed as an opam switch with the following commands
</p>
<div class="org-src-container">
<pre class="src src-shell">opam update
opam switch create 4.12.0~alpha3
--repositories=default,<span style="color: #a0522d;">beta</span>=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
</div>
<p>
If you want to tweak the configuration of the compiler, you can pick configuration options with
</p>
<div class="org-src-container">
<pre class="src src-shell">opam update
opam switch create &lt;switch_name&gt; --packages=ocaml-variants.4.12.0~alpha3+options,&lt;option_list&gt;
--repositories=default,<span style="color: #a0522d;">beta</span>=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
</div>
<p>
where &lt;option_list&gt; is a comma separated list of ocaml-option-* packages. For
instance, for a flambda and afl enabled switch:
</p>
<div class="org-src-container">
<pre class="src src-shell">opam switch create 4.12.0~alpha3+flambda+afl
--packages=ocaml-variants.4.12.0~alpha3+options,ocaml-option-flambda,ocaml-option-afl
--repositories=default,<span style="color: #a0522d;">beta</span>=git+https://github.com/ocaml/ocaml-beta-repository.git
</pre>
</div>
<p>
All available options can be listed with "opam search ocaml-option".
</p>

<p>
The source code for the alpha is also available at these addresses:
</p>

<ul class="org-ul">
<li><a href="https://github.com/ocaml/ocaml/archive/4.12.0-alpha3.tar.gz">https://github.com/ocaml/ocaml/archive/4.12.0-alpha3.tar.gz</a></li>
<li><a href="https://caml.inria.fr/pub/distrib/ocaml-4.12/ocaml-4.12.0~alpha3.tar.gz">https://caml.inria.fr/pub/distrib/ocaml-4.12/ocaml-4.12.0~alpha3.tar.gz</a></li>
</ul>

<p>
If you want to test this version, it is advised to install the alpha opam repository
</p>

<p>
<a href="https://github.com/kit-ty-kate/opam-alpha-repository">https://github.com/kit-ty-kate/opam-alpha-repository</a>
</p>

<p>
with
</p>
<div class="org-src-container">
<pre class="src src-shell">opam repo add alpha git://github.com/kit-ty-kate/opam-alpha-repository.git
</pre>
</div>
<p>
This alpha repository contains various packages patched with fixes in the
process of being upstreamed. Once the repository installed, these patched
packages will take precedence over the non-patched version.
</p>

<p>
If you find any bugs, please report them here:
 <a href="https://github.com/ocaml/ocaml/issues">https://github.com/ocaml/ocaml/issues</a>
</p>
</div>

<div id="outline-container-org47618fb" class="outline-4">
<h4 id="org47618fb">Changes from the second alpha:</h4>
<div class="outline-text-4" id="text-org47618fb">
<ul class="org-ul">
<li><b>additional fixes</b> <a href="https://github.com/ocaml/ocaml/issues/1128">1128</a>, <a href="https://github.com/ocaml/ocaml/issues/7503">7503</a>, <a href="https://github.com/ocaml/ocaml/issues/9036">9036</a>, <a href="https://github.com/ocaml/ocaml/issues/9722">9722</a>, +<a href="https://github.com/ocaml/ocaml/issues/10069">10069</a>: EINTR-based signal handling. When a signal arrives, avoid running its OCaml handler in the middle of a blocking section. Instead, allow control to return quickly to a polling point where the signal handler can safely run, ensuring that</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9907">9907</a>: Fix native toplevel on native Windows. (David Allsopp, review by Florian Angeletti)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10056">10056</a>: Memprof: ensure young_trigger is within the bounds of the minor heap in caml_memprof_renew_minor_sample (regression from <a href="https://github.com/ocaml/ocaml/issues/8684">8684</a>) (David Allsopp, review by Guillaume Munch-Maccagnoni and Jacques-Henri Jourdan)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10062">10062</a>: set ARCH_INT64_PRINTF_FORMAT correctly for both modes of mingw-w64 (David Allsopp, review by Xavier Leroy)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10025">10025</a>: Track custom blocks (e.g. Bigarray) with Statmemprof (Stephen Dolan, review by Leo White, Gabriel Scherer and Jacques-Henri Jourdan)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10070">10070</a>: Fix Float.Array.blit when source and destination arrays coincide. (Nicolás Ojeda Bär, review by Alain Frisch and Xavier Leroy)</li>

<li><b>additional fixes</b> <a href="https://github.com/ocaml/ocaml/issues/9869">9869</a>, +<a href="https://github.com/ocaml/ocaml/issues/10073">10073</a>: Add Unix.SO_REUSEPORT (Yishuai Li, review by Xavier Leroy, amended by David Allsopp)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9877">9877</a>: manual, warn that multi-index indexing operators should be defined in conjunction of single-index ones. (Florian Angeletti, review by Hezekiah M. Carty, Gabriel Scherer, and Marcello Seri)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10046">10046</a>: Link all DLLs with -static-libgcc on mingw32 to prevent dependency on libgcc_s_sjlj-1.dll with mingw-w64 runtime 8.0.0 (previously this was only needed for dllunix.dll). (David Allsopp, report by Andreas Hauptmann, review by Xavier Leroy)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9896">9896</a>: Share the strings representing scopes, fixing some regression on .cmo/.cma sizes (Alain Frisch and Xavier Clerc, review by Gabriel Scherer)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10044">10044</a>: Always report the detected ARCH, MODEL and SYSTEM, even for bytecode- only builds (fixes a "configuration regression" from 4.08 for the Windows builds) (David Allsopp, review by Xavier Leroy)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10071">10071</a>: Fix bug in tests/misc/weaklifetime.ml that was reported in <a href="https://github.com/ocaml/ocaml/issues/10055">10055</a> (Damien Doligez and Gabriel Scherer, report by David Allsopp)</li>

<li><b>breaking change</b> <a href="https://github.com/ocaml/ocaml/issues/8907">8907</a>, <a href="https://github.com/ocaml/ocaml/issues/9878">9878</a>: <code>Typemod.normalize_signature</code> uses wrong environment Does not treat submodules differently when normalizing conjunctive types in polymorphic variants. This may break code that expose conjunctive types in inferred interface. (Jacques Garrigue, report and review by Leo White)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/9739">9739</a>, <a href="https://github.com/ocaml/ocaml/issues/9747">9747</a>: Avoid calling type variables, types that are not variables in recursive occurence error messages (for instance, "Type variable int occurs inside int list") (Florian Angeletti, report by Stephen Dolan, review by Armaël Guéneau)</li>

<li><a href="https://github.com/ocaml/ocaml/issues/10048">10048</a>: Fix bug with generalized local opens. (Leo White, review by Thomas Refis)</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-org376d447" class="outline-2">
<h2 id="3">Lwt 5.4.0, Lwt_ppx 2.0.2, Lwt_react 1.1.4 releases</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-lwt-5-4-0-lwt-ppx-2-0-2-lwt-react-1-1-4-releases/7001/1">https://discuss.ocaml.org/t/ann-lwt-5-4-0-lwt-ppx-2-0-2-lwt-react-1-1-4-releases/7001/1</a>
</p>
</div>

<div id="outline-container-org1effefd" class="outline-3">
<h3 id="org1effefd">Raphaël Proust announced</h3>
<div class="outline-text-3" id="text-org1effefd">
<p>
We are glad to announce the release of version 5.4.0 of Lwt, version 2.0.2 of Lwt_ppx, and version
1.1.4 of Lwt_react.
</p>

<p>
<a href="https://github.com/ocsigen/lwt/releases/tag/5.4.0">https://github.com/ocsigen/lwt/releases/tag/5.4.0</a>
</p>

<p>
It can be installed from opam as usual:
</p>

<div class="org-src-container">
<pre class="src src-shell">opam update
opam upgrade lwt lwt_ppx lwt_react
</pre>
</div>
</div>

<div id="outline-container-orgeeebc62" class="outline-4">
<h4 id="orgeeebc62">OCaml 4.12 compatibility</h4>
<div class="outline-text-4" id="text-orgeeebc62">
<p>
With this release, Lwt is now compatible with OCaml 4.12. Thanks @kit-ty-kate for the contribution
towards this support.
</p>

<p>
Thanks as well to all the other contributors for all the other improvements that made it into this
release. Check-out the release's changelog (link above) for a full list of bugfixes and additions.
</p>
</div>
</div>

<div id="outline-container-org2343717" class="outline-4">
<h4 id="org2343717">Maintainers' notes</h4>
<div class="outline-text-4" id="text-org2343717">
<p>
As per <a href="https://discuss.ocaml.org/t/announcing-a-new-maintainer-for-lwt/6192">a previous announce</a> I am
a co-maintainer of Lwt. With this release I'm taking on a more and more central role in the maintenance
effort. Whilst I've received a lot of help getting this release together, I'm most likely the one
responsible for any issues in the process.
</p>

<p>
I'd like to thank @antron who is as stellar with maintenance of the project as he is with guiding me
through the learning process. I'd also like to thank the opam-repository team who stepped up very
quickly to fix some CI-related build-issues. And I'd like to thank my employer, <a href="https://nomadic-labs.com/">Nomadic
Labs</a>, who agreed to make Lwt maintenance part of my day job.
</p>

<p>
I'm looking forward to all your bug reports, pull requests, comments, ideas, questions, remarks, as
well as any sort of feedback. Don't hesitate to get in touch!
</p>
</div>
</div>
</div>
</div>




<div id="outline-container-orgfcca263" class="outline-2">
<h2 id="4">Senior software engineer at Docent, France - Remote OK</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/senior-software-engineer-at-docent-france-remote-ok/7002/1">https://discuss.ocaml.org/t/senior-software-engineer-at-docent-france-remote-ok/7002/1</a>
</p>
</div>

<div id="outline-container-org8ef9273" class="outline-3">
<h3 id="org8ef9273">Thibaut Mattio announced</h3>
<div class="outline-text-3" id="text-org8ef9273">
<p>
Docent, a company I'm working with, is recruiting an OCaml developer. You can see the job post
<a href="https://www.notion.so/docentart/OCaml-Developer-bc047ff6c80b448e814943f7116fa14b">here</a>
</p>

<p>
The team and project are really nice, I would definitely recommend it!
</p>

<p>
I've built the current version of the backend, so don't hesitate to reach out
(thibaut.mattio@gmail.com) if you have any questions on the tech (or other).
</p>
</div>
</div>
</div>




<div id="outline-container-orge6008b8" class="outline-2">
<h2 id="orge6008b8">Old CWN</h2>
<div class="outline-text-2" id="text-orge6008b8">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
